{
	"version": "https://jsonfeed.org/version/1",
	"title": "Alvin Soon",
	"icon": "https://micro.blog/Alvin/avatar.jpg",
	"home_page_url": "https://alvinsoon.com/",
	"feed_url": "https://alvinsoon.com/feed.json",
	"items": [
		
			{
				"id": "http://alvin.micro.blog/2025/08/15/travels-in-the-rain.html",
				"title": "Travels in the rain",
				"content_html": "<p>The morning skies over Tokyo were clear when I boarded the train. But by the time I stepped out, they had turned grey.</p>\n<p>The rain began softly. I hesitated. I had no umbrella, and the path ahead to Meiji Shrine held no cover. Perhaps I should turn back and stay dry? If I got wet it would ruin my plans for the day. But I didn’t know when I’d be back this way again – so I stepped into it.</p>\n<p>By the time I passed beneath the wooden gate, it was pouring. Water blurred my vision, turning the world into a dream. I reached the main hall, clapped twice, pressed my palms together and gave thanks – thanks for being there, far from home, soaked in the rain.</p>\n<p>For the first twenty-something years of my life, travel was a distant luxury I couldn’t afford. I grew up in Singapore, my world mapped within familiar streets and repetitive schedules. I longed to see something different.</p>\n<p>When I finally began to travel, I treated each trip like a precious jewel: I scripted every hour and every step, no room for weather or whimsy. I thought certainty was the way to keep disappointment at bay.</p>\n<p>But plans dissolve. Trains run late. Storms arrive uninvited. So I learned to listen to the road and hold my itinerary loosely; not just to sightsee, but to explore.</p>\n<p>On a Japanese mountainside, an elderly man pressed a warm cup of tea into my hands, while the rain drummed on the roof. In the forests of Thailand, an unexpected road trip to a temple, where a monk’s relic lay, half bone and half crystal. In the English countryside, where I spent a sleepless night in an eerie room, as portraits of long-dead people gazed at me beside a view to the cemetery next door.</p>\n<p>These moments were never on the schedule.</p>\n<p>I’d be lying if I said I was cured of control. I still prefer clear skies, trains that come on time, and the kind of surprises I already like. There are storms I wouldn’t risk, and days I wish I’d planned better. But I’ve learnt – am still learning – to walk in the rain.</p>\n<p>That morning in Tokyo, I left the shrine and went for breakfast, my clothes clinging to me, my hair a mess, my socks squishing in my shoes. The waitress gave me a strange smile. I smiled back. Outside, the rain kept falling.</p>\n",
				"content_text": "The morning skies over Tokyo were clear when I boarded the train. But by the time I stepped out, they had turned grey.\n\nThe rain began softly. I hesitated. I had no umbrella, and the path ahead to Meiji Shrine held no cover. Perhaps I should turn back and stay dry? If I got wet it would ruin my plans for the day. But I didn’t know when I’d be back this way again – so I stepped into it.\n\nBy the time I passed beneath the wooden gate, it was pouring. Water blurred my vision, turning the world into a dream. I reached the main hall, clapped twice, pressed my palms together and gave thanks – thanks for being there, far from home, soaked in the rain.\n\nFor the first twenty-something years of my life, travel was a distant luxury I couldn’t afford. I grew up in Singapore, my world mapped within familiar streets and repetitive schedules. I longed to see something different.\n\nWhen I finally began to travel, I treated each trip like a precious jewel: I scripted every hour and every step, no room for weather or whimsy. I thought certainty was the way to keep disappointment at bay.\n\nBut plans dissolve. Trains run late. Storms arrive uninvited. So I learned to listen to the road and hold my itinerary loosely; not just to sightsee, but to explore.\n\nOn a Japanese mountainside, an elderly man pressed a warm cup of tea into my hands, while the rain drummed on the roof. In the forests of Thailand, an unexpected road trip to a temple, where a monk’s relic lay, half bone and half crystal. In the English countryside, where I spent a sleepless night in an eerie room, as portraits of long-dead people gazed at me beside a view to the cemetery next door.\n\nThese moments were never on the schedule.\n\nI’d be lying if I said I was cured of control. I still prefer clear skies, trains that come on time, and the kind of surprises I already like. There are storms I wouldn’t risk, and days I wish I’d planned better. But I’ve learnt – am still learning – to walk in the rain.\n\nThat morning in Tokyo, I left the shrine and went for breakfast, my clothes clinging to me, my hair a mess, my socks squishing in my shoes. The waitress gave me a strange smile. I smiled back. Outside, the rain kept falling.\n",
				"date_published": "2025-08-15T17:46:10+08:00",
				"url": "https://alvinsoon.com/2025/08/15/travels-in-the-rain.html"
			},
			{
				"id": "http://alvin.micro.blog/2025/08/03/a-fathers-heart.html",
				"title": "A father’s heart",
				"content_html": "<p>My heart no longer lives inside my chest. It jumps into puddles, bumbles through playgrounds, and falls asleep on my knee. It runs around corners I don’t see and goes places I can’t follow.</p>\n<p>This, I’ve learned, is what it means to be a parent: to watch your most fragile joy live outside of you, in a world you cannot control.</p>\n<p>I’ve never loved this wide and this deep – until the two of you. You taught me what it means to love without conditions, without end. To love someone no matter what, no matter when.</p>\n<p>With love comes its shadow: worry.</p>\n<p>I watch my heart cross busy roads, sweat from fever, fall and sob so hard their faces turn red. I worry about the obvious things – sickness, accidents, growing pains – and the harder ones – climate change, AI, war.</p>\n<p>If I could, I would guarantee you both long, healthy and happy lives. I would make the world kind, fair and forgiving. But I can’t. Nobody escapes life alive, after all.</p>\n<p>But I didn’t bring you into the world because it was safe. It never has been.</p>\n<p>My parents lived through Singapore’s uncertain independence and the cold threat of nuclear annihilation. Their parents had to survive World War II and the occupation. And their parents fled war over treacherous seas on unsafe ships. It goes on and on; parents watching their hearts stumble through fire and ice and storm.</p>\n<p>Still, they chose love. And hope. Because life has always held both darkness and light. Grief and joy. Worry and wonder. <a href=\"https://alvinsoon.com/2025/07/28/rhythms-and-ruptures.html\">If the future is unpredictable</a>, it could just as well turn out better rather than worse.</p>\n<p>So I, your natural-born pessimist of a father, chose hope, too. Is there a better option?</p>\n<p>My only regret is meeting both of you so late. I wish we could have had more time together. But I’m grateful for all the joy and wonder you’ve brought into our lives.</p>\n<p>My heart no longer lives inside my chest; it lives on in two beautiful people I’d trade my life to protect. Take care of yourself and each other. <a href=\"https://alvinsoon.com/2025/05/13/be-kind-and-keep-striving.html\">Be kind and keep striving</a>.</p>\n<p>And remember – wherever you are, whatever happens, wherever you go, my heart is always with you.</p>\n",
				"content_text": "My heart no longer lives inside my chest. It jumps into puddles, bumbles through playgrounds, and falls asleep on my knee. It runs around corners I don’t see and goes places I can’t follow.\n\nThis, I’ve learned, is what it means to be a parent: to watch your most fragile joy live outside of you, in a world you cannot control.\n\nI’ve never loved this wide and this deep – until the two of you. You taught me what it means to love without conditions, without end. To love someone no matter what, no matter when.\n\nWith love comes its shadow: worry. \n\nI watch my heart cross busy roads, sweat from fever, fall and sob so hard their faces turn red. I worry about the obvious things – sickness, accidents, growing pains – and the harder ones – climate change, AI, war.\n\nIf I could, I would guarantee you both long, healthy and happy lives. I would make the world kind, fair and forgiving. But I can’t. Nobody escapes life alive, after all.\n\nBut I didn’t bring you into the world because it was safe. It never has been.\n\nMy parents lived through Singapore’s uncertain independence and the cold threat of nuclear annihilation. Their parents had to survive World War II and the occupation. And their parents fled war over treacherous seas on unsafe ships. It goes on and on; parents watching their hearts stumble through fire and ice and storm.\n\nStill, they chose love. And hope. Because life has always held both darkness and light. Grief and joy. Worry and wonder. [If the future is unpredictable](https://alvinsoon.com/2025/07/28/rhythms-and-ruptures.html), it could just as well turn out better rather than worse.\n\nSo I, your natural-born pessimist of a father, chose hope, too. Is there a better option?\n\nMy only regret is meeting both of you so late. I wish we could have had more time together. But I’m grateful for all the joy and wonder you’ve brought into our lives.\n\nMy heart no longer lives inside my chest; it lives on in two beautiful people I’d trade my life to protect. Take care of yourself and each other. [Be kind and keep striving](https://alvinsoon.com/2025/05/13/be-kind-and-keep-striving.html).\n\nAnd remember – wherever you are, whatever happens, wherever you go, my heart is always with you.\n\n",
				"date_published": "2025-08-03T20:31:21+08:00",
				"url": "https://alvinsoon.com/2025/08/03/a-fathers-heart.html"
			},
			{
				"id": "http://alvin.micro.blog/2025/07/28/rhythms-and-ruptures.html",
				"title": "Rhymes and ruptures",
				"content_html": "<p>In 2020, the world stopped. One weekday, I drove through Singapore’s central business district and saw something I’d never seen before: the streets, empty. I could have parked in the middle of five lanes and had a picnic. I couldn’t understand what was happening.</p>\n<p>That’s when I turned to history.</p>\n<p>I hated the subject in school. History was boring and seemed irrelevant – plus, the teacher made us stand throughout class if we failed our tests. I’m bad at memorising dates, so I stood often! I dropped the subject at the first chance.</p>\n<p>But reading about past pandemics helped me make sense of the present one: people panicked, denied, blamed – just like we were doing. They also adapted, cared, rebuilt. History wasn’t dead and dated anymore – it became a living guide.</p>\n<p>But if human nature was following familiar patterns, events were happening that had never happened before<sup id=\"fnref:1\"><a href=\"#fn:1\" class=\"footnote-ref\" role=\"doc-noteref\">1</a></sup>. Who would have guessed that a virus would trigger a cryptocurrency bubble? Or that companies would migrate to work by video call? Or that a vaccine would be developed faster than anyone thought possible?</p>\n<p>History, I realised, is a story told by a mad poet. It both rhymes <em>and</em> ruptures.</p>\n<p>I’ve always craved certainty. I believed knowledge was armour: if I could only know what was coming, I’d be ready. But past events only look inevitable because of hindsight. To those living in them, the future was always unpredictable.</p>\n<p>So now I try to prepare for range, not precision. We used to keep just enough food in the kitchen. When the lockdown hit, we almost ran out of things to eat. Now we stock more than we need.</p>\n<p>I save more. I challenge my assumptions. Not for the next pandemic, but to be less unprepared for what can’t be predicted.</p>\n<p>I still can’t remember dates. But when the poet writes another rhyme or surprises us with a rupture, I’ll know to pack a little extra water, have my people with me, and hold the lessons of history closely&hellip; if a little loosely.</p>\n<section class=\"footnotes\" role=\"doc-endnotes\">\n<hr>\n<ol>\n<li id=\"fn:1\" role=\"doc-endnote\">\n<p>Quoting Stanford professor Scott Sagan: “Things that have never happened before happen all the time.”&#160;<a href=\"#fnref:1\" class=\"footnote-backref\" role=\"doc-backlink\">&#x21a9;&#xfe0e;</a></p>\n</li>\n</ol>\n</section>\n",
				"content_text": "In 2020, the world stopped. One weekday, I drove through Singapore’s central business district and saw something I’d never seen before: the streets, empty. I could have parked in the middle of five lanes and had a picnic. I couldn’t understand what was happening.\n\nThat’s when I turned to history. \n\nI hated the subject in school. History was boring and seemed irrelevant – plus, the teacher made us stand throughout class if we failed our tests. I’m bad at memorising dates, so I stood often! I dropped the subject at the first chance.\n\nBut reading about past pandemics helped me make sense of the present one: people panicked, denied, blamed – just like we were doing. They also adapted, cared, rebuilt. History wasn’t dead and dated anymore – it became a living guide.\n\nBut if human nature was following familiar patterns, events were happening that had never happened before[^1]. Who would have guessed that a virus would trigger a cryptocurrency bubble? Or that companies would migrate to work by video call? Or that a vaccine would be developed faster than anyone thought possible?\n\nHistory, I realised, is a story told by a mad poet. It both rhymes *and* ruptures.\n\nI’ve always craved certainty. I believed knowledge was armour: if I could only know what was coming, I’d be ready. But past events only look inevitable because of hindsight. To those living in them, the future was always unpredictable.\n\nSo now I try to prepare for range, not precision. We used to keep just enough food in the kitchen. When the lockdown hit, we almost ran out of things to eat. Now we stock more than we need.\n\nI save more. I challenge my assumptions. Not for the next pandemic, but to be less unprepared for what can’t be predicted.\n\nI still can’t remember dates. But when the poet writes another rhyme or surprises us with a rupture, I’ll know to pack a little extra water, have my people with me, and hold the lessons of history closely... if a little loosely.\n\n[^1]:Quoting Stanford professor Scott Sagan: “Things that have never happened before happen all the time.”\n",
				"date_published": "2025-07-28T09:14:33+08:00",
				"url": "https://alvinsoon.com/2025/07/28/rhythms-and-ruptures.html"
			},
			{
				"id": "http://alvin.micro.blog/2025/06/09/temple-of-ashes.html",
				"title": "Makoto and the Temple of Ashes",
				"content_html": "<p>At the top of the hill above the village of Yama-no-kawa, where mists gathered like forgotten dreams, lived the monk Makoto.</p>\n<p>In his austere hut, Makoto lived a life of silence and litany. Each morning, he sat in stillness. Each afternoon, he cut the air with precise martial forms. At night, he wrote. His calligraphy was collected in the capital, though no one could look at the brushstrokes for too long.</p>\n<p>Honed by years of training, Makoto was beautiful – the way a garden in winter is beautiful – except for a scar beneath his left eye, which he said was <em>karma</em> from a previous life.</p>\n<p>Few came to see him. He did not ask why.</p>\n<h3 id=\"a-visitor-the-smell-of-burnt-paper\">A visitor the smell of burnt paper</h3>\n<p>One evening, as autumn turned leaves into faded gold, a stranger arrived. She smelled faintly of burnt paper. Her eyes, narrow and sharp, swept over Makoto as if searching for an answer.</p>\n<p>They drank tea. They spoke little.</p>\n<p>When the last cup was emptied, the stranger seemed to have made a choice. She rose to leave and said, “Beyond the far north, there is a temple the colour of ash. Those who spend a night emerge enlightened. Or mad.”</p>\n<p>That night, Makoto sat watching the stars. When morning came, he packed his robes, his staff and a single bowl. He shut his door, then walked out of the life he’d perfected.</p>\n<h3 id=\"winters-of-deep-longing\">Winters of deep longing</h3>\n<p>Makoto walked deep into the north. He crossed valleys where the trees cast no shadows. He met a boy with his eyes, who asked, “Why did you leave?”, before vanishing in a snowstorm. Makoto regretted not asking the child’s name.</p>\n<p>Once, he took shelter from the rain in an opulent house that stood alone. An old woman there told him, “You have already passed the temple.” In the morning, he woke amongst ruins.</p>\n<p>In time, he forgot how many winters had passed. He forgot the sound of his voice. And then the sound of his name. One day, in a forest where no birds sang, he found the temple.</p>\n<h3 id=\"night-of-dreams-and-nightmares\">Night of dreams and nightmares</h3>\n<p>The temple was not just the colour of ash, it was <em>made</em> of what remained after. Ash, regret, sorrow, a cradle never filled, a question never asked, a promise never made. Fused into pillars, joints and awnings to build an unearthly memorial.</p>\n<p>The main hall was darker than midnight. Makoto sat down and lit a single candle. His breath came short and uneven. It felt like the temple itself was breathing. Watching its intruder. Weighing down on him.</p>\n<p>Night fell. The silence grew thick like a snake coiling itself around Makoto.</p>\n<p>Somewhere, the sound of a boy laughing.</p>\n<p>Then, footsteps. Heavy. Slow. Bare.</p>\n<p>The doors opened.</p>\n<p>A figure stepped in, stooped with age. His robes were torn, his face lined with worries, his eyes like hot coals. A scar marked his left eye, identical, in the same place to Makoto’s.</p>\n<p>Makoto gasped – he <em>knew</em>. “You are me.”</p>\n<p>The figure spoke. “I am what you buried. You sought the solace of silence. I chose the songs of the village. You sought the pureness of solitude. I chose the chaos of love. You held your own hands in meditation. I held a child with one hand while praying with the other.”</p>\n<p>Makoto trembled, “You are caught in the world.”</p>\n<p>“Yes,” said the figure. “Caught. And cracked open.”</p>\n<p>Makoto stumbled to his feet. He took a step back. But his own gaze held him in place.</p>\n<p>There was a long silence.</p>\n<p>Makoto whispered, “What do I lack?”</p>\n<p>The figure stepped close. He placed a hand on Makoto’s chest. Makoto felt something break. But not his bones. Something deeper.</p>\n<p>The figure replied, “You made a perfect life. I made a true one.”</p>\n<p>The candle went out.</p>\n<h3 id=\"chopping-wood-carrying-water\">Chopping wood, carrying water</h3>\n<p>Some said Makoto the monk went mad that night.</p>\n<p>He returned to Yama-no-kawa, but never again to his hut. He slept where he was welcomed. He ate what was offered. He spent his days doing what was needed: mending roofs, tilling the fields, washing wounds, taking care of the old, and playing with the young.</p>\n<p>When asked if he still meditated, he would reply, “Chopping wood, carrying water.”</p>\n<p>Others said he had become enlightened.</p>\n<p>A few whispered he never left the temple. They pointed to his robes, which had turned the colour of ash.</p>\n",
				"content_text": "At the top of the hill above the village of Yama-no-kawa, where mists gathered like forgotten dreams, lived the monk Makoto.\n\nIn his austere hut, Makoto lived a life of silence and litany. Each morning, he sat in stillness. Each afternoon, he cut the air with precise martial forms. At night, he wrote. His calligraphy was collected in the capital, though no one could look at the brushstrokes for too long.\n\nHoned by years of training, Makoto was beautiful – the way a garden in winter is beautiful – except for a scar beneath his left eye, which he said was *karma* from a previous life.\n\nFew came to see him. He did not ask why.\n\n### A visitor the smell of burnt paper\n\nOne evening, as autumn turned leaves into faded gold, a stranger arrived. She smelled faintly of burnt paper. Her eyes, narrow and sharp, swept over Makoto as if searching for an answer.\n\nThey drank tea. They spoke little.\n\nWhen the last cup was emptied, the stranger seemed to have made a choice. She rose to leave and said, “Beyond the far north, there is a temple the colour of ash. Those who spend a night emerge enlightened. Or mad.”\n\nThat night, Makoto sat watching the stars. When morning came, he packed his robes, his staff and a single bowl. He shut his door, then walked out of the life he’d perfected.\n\n### Winters of deep longing\n\nMakoto walked deep into the north. He crossed valleys where the trees cast no shadows. He met a boy with his eyes, who asked, “Why did you leave?”, before vanishing in a snowstorm. Makoto regretted not asking the child’s name.\n\nOnce, he took shelter from the rain in an opulent house that stood alone. An old woman there told him, “You have already passed the temple.” In the morning, he woke amongst ruins.\n\nIn time, he forgot how many winters had passed. He forgot the sound of his voice. And then the sound of his name. One day, in a forest where no birds sang, he found the temple.\n\n### Night of dreams and nightmares\n\nThe temple was not just the colour of ash, it was *made* of what remained after. Ash, regret, sorrow, a cradle never filled, a question never asked, a promise never made. Fused into pillars, joints and awnings to build an unearthly memorial.\n\nThe main hall was darker than midnight. Makoto sat down and lit a single candle. His breath came short and uneven. It felt like the temple itself was breathing. Watching its intruder. Weighing down on him.\n\nNight fell. The silence grew thick like a snake coiling itself around Makoto.\n\nSomewhere, the sound of a boy laughing.\n\nThen, footsteps. Heavy. Slow. Bare.\n\nThe doors opened.\n\nA figure stepped in, stooped with age. His robes were torn, his face lined with worries, his eyes like hot coals. A scar marked his left eye, identical, in the same place to Makoto’s.\n\nMakoto gasped – he *knew*. “You are me.”\n\nThe figure spoke. “I am what you buried. You sought the solace of silence. I chose the songs of the village. You sought the pureness of solitude. I chose the chaos of love. You held your own hands in meditation. I held a child with one hand while praying with the other.”\n\nMakoto trembled, “You are caught in the world.”\n\n“Yes,” said the figure. “Caught. And cracked open.”\n\nMakoto stumbled to his feet. He took a step back. But his own gaze held him in place.\n\nThere was a long silence.\n\nMakoto whispered, “What do I lack?”\n\nThe figure stepped close. He placed a hand on Makoto’s chest. Makoto felt something break. But not his bones. Something deeper.\n\nThe figure replied, “You made a perfect life. I made a true one.”\n\nThe candle went out.\n\n### Chopping wood, carrying water\n\nSome said Makoto the monk went mad that night.\n\nHe returned to Yama-no-kawa, but never again to his hut. He slept where he was welcomed. He ate what was offered. He spent his days doing what was needed: mending roofs, tilling the fields, washing wounds, taking care of the old, and playing with the young.\n\nWhen asked if he still meditated, he would reply, “Chopping wood, carrying water.”\n\nOthers said he had become enlightened.\n\nA few whispered he never left the temple. They pointed to his robes, which had turned the colour of ash.\n",
				"date_published": "2025-06-09T18:15:04+08:00",
				"url": "https://alvinsoon.com/2025/06/09/temple-of-ashes.html"
			},
			{
				"id": "http://alvin.micro.blog/2025/06/06/a-tale-of-captains.html",
				"title": "A tale of 3 captains",
				"content_html": "<p>On a moonless night in the port city of Singa, an old merchant summoned his three sons. He was dying, but he had one last secret to tell.</p>\n<p>The merchant lay in his bed, skin sallow, breath shallow, clutching a locked box to his chest. Though it was plain wood and tarnished brass, his sons had never seen it open.</p>\n<p>With shaking fingers, he unlocked the box.</p>\n<p>It revealed an old, leathery parchment, stiff, marked with indecipherable symbols. The smell of roses filled the room. <em>Nothing more than a piece of paper?</em> his sons wondered.</p>\n<p>But their father’s eyes gleamed.</p>\n<p>“When I was younger than you,” he whispered, “I found this treasure map, hidden in a broken stupa, in the ruins of Nengalor. I never told anyone, not even your mother.”</p>\n<p>His sons were surprised: the ruins were forbidden. But even if they weren’t, the ghosts weren’t exactly welcoming.</p>\n<p>“I meant to go,” he said. “But then came trade, and children, and war, and… other wome—things. I leave the map to you now. Do with it as you will.”</p>\n<p>“But father,” the first son blurted out, “If you’ve never gone looking for the treasure, how do you know it exists?”</p>\n<p>“But son,” their father replied with a smile, “if you don’t go looking, how do you know it doesn’t?”</p>\n<p>And with that, he passed away.</p>\n<h3 id=\"the-doubtless\">The Doubtless</h3>\n<p>The first son, Yi, never leapt before looking and sometimes didn’t leap at all.</p>\n<p>He bought the <em>Doubtless</em> – a majestic ship, polished to a sheen. He hired the finest navigator and the most renowned weather-seer in Singa. They studied the map for weeks, consulting obscure texts and old charts for clues.</p>\n<p><em>Doubtless</em> was ready, but Yi refused to cast off until his navigator could guarantee the treasure’s coordinates, and the weather-seer could promise good weather on the voyage.</p>\n<p>Neither could do either, so the first son waited. And waited. And waited.</p>\n<p>The crew eventually left him. The ship grew barnacles. And Yi kept waiting.</p>\n<h3 id=\"the-fearless\">The Fearless</h3>\n<p>The second son, Er, was a combination of haste and bluster. He grew impatient with his brother, made a copy of the map and hired the <em>Fearless</em>.</p>\n<p><em>Fearless</em> was lithe, angular, and looked like it was moving even when it was standing still. But the ship was still recovering from its last run, its lifeboats cracked, its crew ragged.</p>\n<p>Er ignored his crew’s requests to replenish the ship – he couldn’t wait to lay his hands on treasure. <em>Fearless</em> sliced off into the waves, travelling light and fast.</p>\n<p>He overruled the quartermaster’s plea to restock at the next port, pointing to the horizon and saying something about his <em>destiny</em>.</p>\n<p>Destiny responded with a storm.</p>\n<p>Lightning split the mast. The hull groaned and split in half. The crew went down beneath the raging waves.</p>\n<p>Er survived by clinging to driftwood, alongside two sailors. They washed ashore on a desert island, where they spent seven miserable days and nights before being rescued.</p>\n<p>Er returned home and never set sail again.</p>\n<h3 id=\"the-artful\">The Artful</h3>\n<p>The third son, San, waited longer than he liked, then watched his brothers fail exactly as he feared.</p>\n<p>He engaged the <em>Artful</em>, an ageing patchwork of a ship that had mismatched sails and uneven repairs. His navigator was half-blind. His weather-seer was half-mad. They wouldn’t make promises, but San shrugged and said, “Let’s find out.”</p>\n<p>He stocked more food than needed and helped refit the lifeboats himself. When all seemed ready, he tacked a charm to the hull and set off with his father’s map.</p>\n<p><em>Artful</em> got lost more than once. They dodged woolly octopi the size of small islands in the Midnight Sea. They narrowly escaped the cannibal shamans of the Southern Tribes. San nearly threw himself into the Phantom Reef, lured by mournful lullabies that sang to him in his mother’s voice.</p>\n<p>At one point, San almost tossed the map overboard. But the smell of roses bloomed throughout the ship. He kept going.</p>\n<p>They never found the treasure.</p>\n<p>But they found the lost island of Surrusus, where the stars spun backwards. They found the crystal mountain at the top of the world, shining in the night. And once, when they were lost at sea, they glimpsed a wreck of <em>Artful</em> in the fog and dared not get close.</p>\n<p>They made friends. They made enemies. They buried their dead. They <em>became</em>.</p>\n<h3 id=\"the-way-home\">The way home</h3>\n<p>San returned home with grey in his beard. Yi barely recognised him. Er flinched at the smell of the sea. All embraced the other tightly.</p>\n<p>San returned the aged map to the plain box and locked it. The scent of roses filled the air, stronger than ever. He smiled. He placed the box on a shelf, low enough for the children to see, but high enough that they couldn’t reach. Perhaps one day…</p>\n<h2 id=\"epilogue\">Epilogue</h2>\n<p>Somewhere in the city of Singa, a box clicked open. A breeze stirred. And a small girl whispered, “What’s that smell?”</p>\n",
				"content_text": "On a moonless night in the port city of Singa, an old merchant summoned his three sons. He was dying, but he had one last secret to tell.\n\nThe merchant lay in his bed, skin sallow, breath shallow, clutching a locked box to his chest. Though it was plain wood and tarnished brass, his sons had never seen it open.\n\nWith shaking fingers, he unlocked the box.\n\nIt revealed an old, leathery parchment, stiff, marked with indecipherable symbols. The smell of roses filled the room. *Nothing more than a piece of paper?* his sons wondered.\n\nBut their father’s eyes gleamed.\n\n“When I was younger than you,” he whispered, “I found this treasure map, hidden in a broken stupa, in the ruins of Nengalor. I never told anyone, not even your mother.” \n\nHis sons were surprised: the ruins were forbidden. But even if they weren’t, the ghosts weren’t exactly welcoming.\n\n“I meant to go,” he said. “But then came trade, and children, and war, and… other wome—things. I leave the map to you now. Do with it as you will.”\n\n“But father,” the first son blurted out, “If you’ve never gone looking for the treasure, how do you know it exists?”\n\n“But son,” their father replied with a smile, “if you don’t go looking, how do you know it doesn’t?”\n\nAnd with that, he passed away.\n\n### The Doubtless\n\nThe first son, Yi, never leapt before looking and sometimes didn’t leap at all.\n\nHe bought the *Doubtless* – a majestic ship, polished to a sheen. He hired the finest navigator and the most renowned weather-seer in Singa. They studied the map for weeks, consulting obscure texts and old charts for clues.\n\n*Doubtless* was ready, but Yi refused to cast off until his navigator could guarantee the treasure’s coordinates, and the weather-seer could promise good weather on the voyage.\n\nNeither could do either, so the first son waited. And waited. And waited.\n\nThe crew eventually left him. The ship grew barnacles. And Yi kept waiting.\n\n### The Fearless\n\nThe second son, Er, was a combination of haste and bluster. He grew impatient with his brother, made a copy of the map and hired the *Fearless*.\n\n*Fearless* was lithe, angular, and looked like it was moving even when it was standing still. But the ship was still recovering from its last run, its lifeboats cracked, its crew ragged.\n\nEr ignored his crew’s requests to replenish the ship – he couldn’t wait to lay his hands on treasure. *Fearless* sliced off into the waves, travelling light and fast.\n\nHe overruled the quartermaster’s plea to restock at the next port, pointing to the horizon and saying something about his *destiny*.\n\nDestiny responded with a storm.\n\nLightning split the mast. The hull groaned and split in half. The crew went down beneath the raging waves.\n\nEr survived by clinging to driftwood, alongside two sailors. They washed ashore on a desert island, where they spent seven miserable days and nights before being rescued.\n\nEr returned home and never set sail again.\n\n### The Artful\n\nThe third son, San, waited longer than he liked, then watched his brothers fail exactly as he feared.\n\nHe engaged the *Artful*, an ageing patchwork of a ship that had mismatched sails and uneven repairs. His navigator was half-blind. His weather-seer was half-mad. They wouldn’t make promises, but San shrugged and said, “Let’s find out.”\n\nHe stocked more food than needed and helped refit the lifeboats himself. When all seemed ready, he tacked a charm to the hull and set off with his father’s map.\n\n*Artful* got lost more than once. They dodged woolly octopi the size of small islands in the Midnight Sea. They narrowly escaped the cannibal shamans of the Southern Tribes. San nearly threw himself into the Phantom Reef, lured by mournful lullabies that sang to him in his mother’s voice.\n\nAt one point, San almost tossed the map overboard. But the smell of roses bloomed throughout the ship. He kept going.\n\nThey never found the treasure.\n\nBut they found the lost island of Surrusus, where the stars spun backwards. They found the crystal mountain at the top of the world, shining in the night. And once, when they were lost at sea, they glimpsed a wreck of *Artful* in the fog and dared not get close.\n\nThey made friends. They made enemies. They buried their dead. They *became*.\n\n### The way home\n\nSan returned home with grey in his beard. Yi barely recognised him. Er flinched at the smell of the sea. All embraced the other tightly.\n\nSan returned the aged map to the plain box and locked it. The scent of roses filled the air, stronger than ever. He smiled. He placed the box on a shelf, low enough for the children to see, but high enough that they couldn’t reach. Perhaps one day…\n\n## Epilogue\n\nSomewhere in the city of Singa, a box clicked open. A breeze stirred. And a small girl whispered, “What’s that smell?”\n",
				"date_published": "2025-06-06T15:48:06+08:00",
				"url": "https://alvinsoon.com/2025/06/06/a-tale-of-captains.html"
			},
			{
				"id": "http://alvin.micro.blog/2025/05/28/a-song-in-the-sun.html",
				"title": "A song in the sun",
				"content_html": "<p>It was dark when we rushed to the hospital. The waiting room was ice, and your hands were ice, and my insides were frost. Tears flowed like a stream down your face, from an eye that wouldn’t close. Half your face wasn’t moving.</p>\n<p>We didn’t know what was happening. I tried to give you warmth I didn’t feel. “Let’s go somewhere when you get better,” I said. “Let’s go to New Zealand.” You’d dreamed of going, but Aotearoa had always been out of reach. <em>Someday</em>, I’d thought. But how many more somedays would we have?</p>\n<p>It was Bell’s Palsy, a condition that causes facial paralysis. It has no known cause, no known cure. Just time. It took you six months to recover. When you finally smiled with both sides of your face, I thought we were done, and I locked my promise away.</p>\n<p><em>I’m being practical</em>, I thought. The little money we’d saved was a safe we’d built against uncertainty.</p>\n<p>(Where do deferred dreams go when we bury them under <em>maybes</em> and <em>somedays</em>? I imagined a quiet room at the end of my life, filled with unopened boxes named <em>later</em>. What would I find if I looked inside?)</p>\n<p>“You promised,” you reminded me. I didn’t say no, but I didn’t say yes. “You promised,” you whispered. “I know,” I did the math and kept quiet. “You promised,” you said, not with anger, but like somebody who’d waited in a room longer than she should have.</p>\n<p>So I bought the tickets. The locks cracked. The numbers broke.</p>\n<p>The first town in New Zealand was grey, dusty and drab. Fog between the mountains, hiding the peaks. I sat in the motel, wondering if we should have come.</p>\n<p>But then we drove deeper into the country and the fog began to lift. We drank from cold rivers. We rested in the deep valleys. We walked amongst ancient trees. Somewhere between the mountains, fear began to loosen its grip.</p>\n<p>One afternoon, the sun set a field ablaze with golden light. You sang to me and I was brought back to life. Your hair was aflame and your eyes were aflame and your voice was a flame.</p>\n<p>What had I been afraid of? What was the cost of a locked life? What had I understood in the hospital room that I’d forgotten?</p>\n<p>I thought your eye wouldn’t shut, but it was mine that refused to open. I thought I’d promised you a visit to the land of the long white cloud, but I was really promising to not let fear speak louder than love. I thought New Zealand was the gift. But the truth is: you were the gift all along.</p>\n",
				"content_text": "It was dark when we rushed to the hospital. The waiting room was ice, and your hands were ice, and my insides were frost. Tears flowed like a stream down your face, from an eye that wouldn’t close. Half your face wasn’t moving.\n\nWe didn’t know what was happening. I tried to give you warmth I didn’t feel. “Let’s go somewhere when you get better,” I said. “Let’s go to New Zealand.” You’d dreamed of going, but Aotearoa had always been out of reach. *Someday*, I’d thought. But how many more somedays would we have?\n\nIt was Bell’s Palsy, a condition that causes facial paralysis. It has no known cause, no known cure. Just time. It took you six months to recover. When you finally smiled with both sides of your face, I thought we were done, and I locked my promise away.\n\n*I’m being practical*, I thought. The little money we’d saved was a safe we’d built against uncertainty.\n\n(Where do deferred dreams go when we bury them under *maybes* and *somedays*? I imagined a quiet room at the end of my life, filled with unopened boxes named *later*. What would I find if I looked inside?)\n\n“You promised,” you reminded me. I didn’t say no, but I didn’t say yes. “You promised,” you whispered. “I know,” I did the math and kept quiet. “You promised,” you said, not with anger, but like somebody who’d waited in a room longer than she should have.\n\nSo I bought the tickets. The locks cracked. The numbers broke.\n\nThe first town in New Zealand was grey, dusty and drab. Fog between the mountains, hiding the peaks. I sat in the motel, wondering if we should have come.\n\nBut then we drove deeper into the country and the fog began to lift. We drank from cold rivers. We rested in the deep valleys. We walked amongst ancient trees. Somewhere between the mountains, fear began to loosen its grip.\n\nOne afternoon, the sun set a field ablaze with golden light. You sang to me and I was brought back to life. Your hair was aflame and your eyes were aflame and your voice was a flame.\n\nWhat had I been afraid of? What was the cost of a locked life? What had I understood in the hospital room that I’d forgotten?\n\nI thought your eye wouldn’t shut, but it was mine that refused to open. I thought I’d promised you a visit to the land of the long white cloud, but I was really promising to not let fear speak louder than love. I thought New Zealand was the gift. But the truth is: you were the gift all along.\n",
				"date_published": "2025-05-28T16:15:58+08:00",
				"url": "https://alvinsoon.com/2025/05/28/a-song-in-the-sun.html"
			},
			{
				"id": "http://alvin.micro.blog/2025/05/13/be-kind-and-keep-striving.html",
				"title": "Be kind and keep striving",
				"content_html": "<p>It was supposed to be easy. I’d been training for years: drills, sparring, conditioning. He’d just started. This would be a light match.</p>\n<p>But a glancing blow hit like a hammer to my ribs. My knees buckled. I couldn’t move. My friends stopped the match before it’d barely begun. My face burned, but not from the pain.</p>\n<p>It’s one thing to lose. It’s another to lose to someone who shouldn’t beat you. At sixteen, I believed effort guaranteed results. But the equation broke that day.</p>\n<p>“You need skill and luck in a fight,” my <em>sensei</em> taught me later. “The more you have of one, the less you need of the other.” At the time, I thought he was talking about fighting. Now I understand he was talking about everything.</p>\n<p>I’d thought of hard work as armour. Kneeling there on the floor, I glimpsed a break in that belief. Meritocracy promises fairness, but the word was originally meant as warning. In theory, it rewards effort. In practice, it forgets that there are things beyond our control.</p>\n<p>Some people become cruel, believing that failure proves weakness. Others become bitter, convinced that effort is a lie. A few find something deeper: they marry striving with kindness<sup id=\"fnref:1\"><a href=\"#fn:1\" class=\"footnote-ref\" role=\"doc-noteref\">1</a></sup>. They learn to decouple failure from blame and success from superiority, because success is not always proof, and failure is not always fault.</p>\n<p>I used to think the loss was my failure. Now I see it was my teacher. When I could breathe again, I stood, bowed to my opponent and walked off the mat. The next day, I went back to training.</p>\n<section class=\"footnotes\" role=\"doc-endnotes\">\n<hr>\n<ol>\n<li id=\"fn:1\" role=\"doc-endnote\">\n<p>“Be kind and keep striving” is a phrase I learnt from classical pianist Tiffany Poon.&#160;<a href=\"#fnref:1\" class=\"footnote-backref\" role=\"doc-backlink\">&#x21a9;&#xfe0e;</a></p>\n</li>\n</ol>\n</section>\n",
				"content_text": "It was supposed to be easy. I’d been training for years: drills, sparring, conditioning. He’d just started. This would be a light match.\n\nBut a glancing blow hit like a hammer to my ribs. My knees buckled. I couldn’t move. My friends stopped the match before it’d barely begun. My face burned, but not from the pain.\n\nIt’s one thing to lose. It’s another to lose to someone who shouldn’t beat you. At sixteen, I believed effort guaranteed results. But the equation broke that day.\n\n“You need skill and luck in a fight,” my *sensei* taught me later. “The more you have of one, the less you need of the other.” At the time, I thought he was talking about fighting. Now I understand he was talking about everything.\n\nI’d thought of hard work as armour. Kneeling there on the floor, I glimpsed a break in that belief. Meritocracy promises fairness, but the word was originally meant as warning. In theory, it rewards effort. In practice, it forgets that there are things beyond our control.\n\nSome people become cruel, believing that failure proves weakness. Others become bitter, convinced that effort is a lie. A few find something deeper: they marry striving with kindness[^1]. They learn to decouple failure from blame and success from superiority, because success is not always proof, and failure is not always fault.\n\nI used to think the loss was my failure. Now I see it was my teacher. When I could breathe again, I stood, bowed to my opponent and walked off the mat. The next day, I went back to training.\n\n[^1]: “Be kind and keep striving” is a phrase I learnt from classical pianist Tiffany Poon.\n",
				"date_published": "2025-05-13T07:51:14+08:00",
				"url": "https://alvinsoon.com/2025/05/13/be-kind-and-keep-striving.html"
			},
			{
				"id": "http://alvin.micro.blog/2025/04/30/the-quiet-forest.html",
				"title": "The quiet forest",
				"content_html": "<!-- raw HTML omitted -->\n<p>The bell rings before the birds remember to sing. I step outside my hut and greet the moon, my jacket around me like a shield. It is too thin against the biting wind.</p>\n<p>In the distance, the silhouette of Wat Pa Don Hai Soke. I am not at home in the forests of northeast Thailand, but this temple has made a home in me. I walk the gravel path to the meditation hall, stones crunching like the bones of pilgrims.</p>\n<p>There are nine more days of a simple schedule: 12 hours of meditation, one meal before noon, silence at all times. No devices, no books, no writing. The trees still like silent sentries. <em>Perhaps I was mad to come here,</em> I think. But my heart had become an open wound and was bleeding sorrow onto the ones I loved.</p>\n<p>The word ‘retreat’ has two meanings. The first is to withdraw as a result of defeat. It is the breaking of armies, the gnashing of hope. The second means sanctuary. It is the victory of the spirit, the healing of hurts. I’d arrived unsure which was waiting for me.</p>\n<p>A long time ago, Siddhartha Gautama sat under a fig tree in Bodh Gaya, India and entered meditation. Now six years into his search, he vowed not to stand again until he found enlightenment. His nemesis, the arch-demon Mara, mounted a war elephant and held a thousand weapons on a thousand arms. He attacked Gautama with rocks, swords, spears, arrows, fireballs and javelins. Each time, Gautama transformed them into flowers.</p>\n<p>When the sun rose, Siddhartha Gautama was no more. Only the Buddha – “the awakened one” – remained. He had reached the end of suffering.</p>\n<p>I have practiced for 20 years and still know nothing. Stillness feels, at first, like prison. My body complains: it was built for softer living. My mind protests: it was built for faster moving.</p>\n<p>Each day repeats: I wake in the dark. I sit. I walk. I sit again. I feed the mind nothing but breath and silence and aching bones. At first, it rages. It snaps its teeth. It chews the ropes. Later, it slumps. Then, sometimes, it listens. I do not run (<em>I want to</em>). I do not howl (<em>I howl inside</em>). I stay, the way the trees stay when the wind comes. Somewhere, between one breath and the next, I begin to disappear. <em>Perhaps I am not mad after all</em>, I think.</p>\n<p>On the last day, I vow not to move again until an hour of meditation is complete. Pain arrives like a thousand arrows – shoulder burning, legs cramping, back trembling. Every minute a kingdom lost. It takes everything I have to remain still.</p>\n<p>And then I realise I have nothing left. I cannot win. I give up hope. <em>I am breaking,</em> I think. <em>Let me break.</em> No retreat. Full surrender. And in that abandonment, I fall through myself and find only breath. Breath and the bright nothing beyond.</p>\n<p>Outside, the songs of birds. The bell rings. My eyes open, I look at my watch and laugh. I have gone past the hour. I have gone past myself.</p>\n<p>When the sun rises, I leave the temple. I hesitate at the threshold – I had come to love the quiet. But I hadn’t come here simply for myself. I came to retreat so I could return. So I could transform arrows into flowers.</p>\n<p>The path beneath my feet, guiding me home, until I leave my names behind.</p>\n<h2 id=\"afterword\">Afterword</h2>\n<p>This essay was reconstructed from one I wrote in 2016 about my fourth visit to Wat Pa Don Hai Soke. I left fully expecting to return, I didn’t expect that I would never see its abbot again. I want to thank Venerable Ajahn Sa-ard for his kindness and generosity; I shall always remember the secret he gave me when we first met.</p>\n",
				"content_text": "<img src=\"https://eu.uploads.micro.blog/419/2025/watpadonhaisoke.webp\" width=\"600\" height=\"400\" alt=\"Forest monastery Wat Pa Don Hai Soke at dawn.\">\n\nThe bell rings before the birds remember to sing. I step outside my hut and greet the moon, my jacket around me like a shield. It is too thin against the biting wind.\n\nIn the distance, the silhouette of Wat Pa Don Hai Soke. I am not at home in the forests of northeast Thailand, but this temple has made a home in me. I walk the gravel path to the meditation hall, stones crunching like the bones of pilgrims.\n\nThere are nine more days of a simple schedule: 12 hours of meditation, one meal before noon, silence at all times. No devices, no books, no writing. The trees still like silent sentries. *Perhaps I was mad to come here,* I think. But my heart had become an open wound and was bleeding sorrow onto the ones I loved.\n\nThe word ‘retreat’ has two meanings. The first is to withdraw as a result of defeat. It is the breaking of armies, the gnashing of hope. The second means sanctuary. It is the victory of the spirit, the healing of hurts. I’d arrived unsure which was waiting for me.\n\nA long time ago, Siddhartha Gautama sat under a fig tree in Bodh Gaya, India and entered meditation. Now six years into his search, he vowed not to stand again until he found enlightenment. His nemesis, the arch-demon Mara, mounted a war elephant and held a thousand weapons on a thousand arms. He attacked Gautama with rocks, swords, spears, arrows, fireballs and javelins. Each time, Gautama transformed them into flowers.\n\nWhen the sun rose, Siddhartha Gautama was no more. Only the Buddha – “the awakened one” – remained. He had reached the end of suffering.\n\nI have practiced for 20 years and still know nothing. Stillness feels, at first, like prison. My body complains: it was built for softer living. My mind protests: it was built for faster moving.\n\nEach day repeats: I wake in the dark. I sit. I walk. I sit again. I feed the mind nothing but breath and silence and aching bones. At first, it rages. It snaps its teeth. It chews the ropes. Later, it slumps. Then, sometimes, it listens. I do not run (*I want to*). I do not howl (*I howl inside*). I stay, the way the trees stay when the wind comes. Somewhere, between one breath and the next, I begin to disappear. *Perhaps I am not mad after all*, I think.\n\nOn the last day, I vow not to move again until an hour of meditation is complete. Pain arrives like a thousand arrows – shoulder burning, legs cramping, back trembling. Every minute a kingdom lost. It takes everything I have to remain still.\n\nAnd then I realise I have nothing left. I cannot win. I give up hope. *I am breaking,* I think. *Let me break.* No retreat. Full surrender. And in that abandonment, I fall through myself and find only breath. Breath and the bright nothing beyond.\n\nOutside, the songs of birds. The bell rings. My eyes open, I look at my watch and laugh. I have gone past the hour. I have gone past myself.\n\nWhen the sun rises, I leave the temple. I hesitate at the threshold – I had come to love the quiet. But I hadn’t come here simply for myself. I came to retreat so I could return. So I could transform arrows into flowers.\n\nThe path beneath my feet, guiding me home, until I leave my names behind.\n\n## Afterword\n\nThis essay was reconstructed from one I wrote in 2016 about my fourth visit to Wat Pa Don Hai Soke. I left fully expecting to return, I didn’t expect that I would never see its abbot again. I want to thank Venerable Ajahn Sa-ard for his kindness and generosity; I shall always remember the secret he gave me when we first met.\n",
				"date_published": "2025-04-30T11:40:45+08:00",
				"url": "https://alvinsoon.com/2025/04/30/the-quiet-forest.html"
			},
			{
				"id": "http://alvin.micro.blog/2025/04/23/the-map-of-wonder.html",
				"title": "The map of wonder",
				"content_html": "<p>I hadn’t expected to walk into a cemetery. One afternoon in Tokyo, I put aside my map and followed a tree-lined path away from the noise.</p>\n<p>A young family picnicked among graves, gentle laughter echoing across silent tombstones. At the end of the street stood a cafe with red awnings. I sat outside and drank a velvety hot chocolate, heart warmed by the sun.</p>\n<p>But the road less travelled isn’t always sweet. In Incheon, I chased ceramics for a photography project, only to find shuttered workshops, dust settling in the air like disappointment. I waited for a bus, whose arrival was as inscrutable as the village map.</p>\n<p>So I understand the appeal of the well-trodden road. A favourite store, an everyday bowl of noodles, a dog-eared book – these are waypoints that never disappoint. Sometimes, after a long day, I want to sink into well-known comforts.</p>\n<p>Even the familiar can still contain secrets. Reading a book for the tenth time uncovers an overlooked sentence. Returning to a dish I’ve eaten for years reveals a new aroma. If discovery is finding what we didn’t expect, deepening is finding anew in the expected.</p>\n<p>Sometimes we stray and sometimes we stay. One path invites surprise, the other, depth. But either can fail to open us if we’re not paying attention. Ultimately, it’s not the movement that matters, but the place within where attention meets presence. Whether we’re truly there, wherever “there” is.</p>\n<p>The map to wonder lies in the space between presence and absence.</p>\n",
				"content_text": "I hadn’t expected to walk into a cemetery. One afternoon in Tokyo, I put aside my map and followed a tree-lined path away from the noise. \n\nA young family picnicked among graves, gentle laughter echoing across silent tombstones. At the end of the street stood a cafe with red awnings. I sat outside and drank a velvety hot chocolate, heart warmed by the sun.\n\nBut the road less travelled isn’t always sweet. In Incheon, I chased ceramics for a photography project, only to find shuttered workshops, dust settling in the air like disappointment. I waited for a bus, whose arrival was as inscrutable as the village map.\n\nSo I understand the appeal of the well-trodden road. A favourite store, an everyday bowl of noodles, a dog-eared book – these are waypoints that never disappoint. Sometimes, after a long day, I want to sink into well-known comforts.\n\nEven the familiar can still contain secrets. Reading a book for the tenth time uncovers an overlooked sentence. Returning to a dish I’ve eaten for years reveals a new aroma. If discovery is finding what we didn’t expect, deepening is finding anew in the expected.\n\nSometimes we stray and sometimes we stay. One path invites surprise, the other, depth. But either can fail to open us if we’re not paying attention. Ultimately, it’s not the movement that matters, but the place within where attention meets presence. Whether we’re truly there, wherever “there” is.\n\nThe map to wonder lies in the space between presence and absence.\n",
				"date_published": "2025-04-23T09:03:45+08:00",
				"url": "https://alvinsoon.com/2025/04/23/the-map-of-wonder.html"
			},
			{
				"id": "http://alvin.micro.blog/2025/04/16/no-way-as-way.html",
				"title": "No way as way",
				"content_html": "<p>Before he became a legend, Bruce Lee was a brash young man willing to fight for what he believed in.</p>\n<p>When he opened his gung-fu school in Oakland, that belief was put to the test. The local Chinese martial arts community, locked in tradition, gave him an ultimatum: stop teaching non-Chinese or fight for the right to continue.</p>\n<p>It was 1964. America had just passed the Civil Rights Act – legally ending segregation, but not erasing it. Even within Lee’s culture, the walls around knowledge remained high.</p>\n<p>Lee chose to tear them down. The fight lasted three minutes. He won, but he didn’t feel victorious.</p>\n<p><em>It should have taken one minute</em>, Lee thought. Something in his training had failed him. His techniques, honed in the rigidity of classical forms, had limited him.</p>\n<p>That’s when Bruce Lee, already a teacher, became a student again.</p>\n<p>Four decades later, I wrestled with the same question: <em>can I start over?</em></p>\n<p>I’d earned my black belt – 10 years in a historic martial art. I knew how to roll, how to throw a human being, how to break bones. But I also knew that none of it worked when I needed it most.</p>\n<p>And so I let it go.</p>\n<p>I entered a combatives school, one that trained law enforcement and military. I was armed with nothing but questions and doubt. My old beliefs resisted. My ego took a bruising. I was unlearning my old ways, but in the arena, something truer was stirring.</p>\n<blockquote>\n<p>“In the beginner’s mind there are many possibilities, in the expert’s mind there are few.”\n&ndash; Shunryu Suzuki, <em>Zen Mind, Beginner&rsquo;s Mind</em>.</p>\n</blockquote>\n<p>Lee called this a process of continuing growth. Not a style. Not a crystallisation. But a way of honestly questioning and expressing oneself.</p>\n<p>He began anew by breaking down his preconceptions. Lee learnt without limits, blending fencing, boxing, Wing Chun, and new and old training methods. Not to create a new style but to dismantle them.</p>\n<p>Out of that exploration came Jeet Kune Do – ‘the way of the intercepting fist’, a way of fighting, but also a way of seeing. The JKD symbol declares: “Having no way as way. Having no limitation as limitation.”</p>\n<p>In the movie <em>Way of the Dragon</em>, Lee fights Chuck Norris in a Roman colosseum. At first, Norris has the upper hand. Lee takes a beating, then adapts. He bends, feints, switches rhythm. Norris stays rigid and loses.</p>\n<p>Bruce Lee died at 32, still evolving. He’s remembered as a master, but maybe what made him great was his willingness to be a student.</p>\n",
				"content_text": "Before he became a legend, Bruce Lee was a brash young man willing to fight for what he believed in.\n\nWhen he opened his gung-fu school in Oakland, that belief was put to the test. The local Chinese martial arts community, locked in tradition, gave him an ultimatum: stop teaching non-Chinese or fight for the right to continue.\n\nIt was 1964. America had just passed the Civil Rights Act – legally ending segregation, but not erasing it. Even within Lee’s culture, the walls around knowledge remained high.\n\nLee chose to tear them down. The fight lasted three minutes. He won, but he didn’t feel victorious.\n\n*It should have taken one minute*, Lee thought. Something in his training had failed him. His techniques, honed in the rigidity of classical forms, had limited him.\n\nThat’s when Bruce Lee, already a teacher, became a student again.\n\nFour decades later, I wrestled with the same question: *can I start over?*\n\nI’d earned my black belt – 10 years in a historic martial art. I knew how to roll, how to throw a human being, how to break bones. But I also knew that none of it worked when I needed it most.\n\nAnd so I let it go.\n\nI entered a combatives school, one that trained law enforcement and military. I was armed with nothing but questions and doubt. My old beliefs resisted. My ego took a bruising. I was unlearning my old ways, but in the arena, something truer was stirring.\n\n>“In the beginner’s mind there are many possibilities, in the expert’s mind there are few.”\n>-- Shunryu Suzuki, *Zen Mind, Beginner's Mind*.\n\nLee called this a process of continuing growth. Not a style. Not a crystallisation. But a way of honestly questioning and expressing oneself.\n\nHe began anew by breaking down his preconceptions. Lee learnt without limits, blending fencing, boxing, Wing Chun, and new and old training methods. Not to create a new style but to dismantle them.\n\nOut of that exploration came Jeet Kune Do – ‘the way of the intercepting fist’, a way of fighting, but also a way of seeing. The JKD symbol declares: “Having no way as way. Having no limitation as limitation.”\n\nIn the movie *Way of the Dragon*, Lee fights Chuck Norris in a Roman colosseum. At first, Norris has the upper hand. Lee takes a beating, then adapts. He bends, feints, switches rhythm. Norris stays rigid and loses.\n\nBruce Lee died at 32, still evolving. He’s remembered as a master, but maybe what made him great was his willingness to be a student.\n",
				"date_published": "2025-04-16T07:53:24+08:00",
				"url": "https://alvinsoon.com/2025/04/16/no-way-as-way.html"
			},
			{
				"id": "http://alvin.micro.blog/2025/04/11/the-starfighter.html",
				"title": "The starfighter",
				"content_html": "<p>It was a bright, busy Saturday morning. We wandered through the mall, our son darting ahead, and our daughter nestled in our arms. As we walked into the LEGO store, their eyes lit up. They always loved playing with the loose bricks near the front.</p>\n<p>I’d held off on buying a set since our son was born. He’d been too small for the tiny bricks. But now he was nearing three, and I thought maybe – just maybe – we could build something together. I chose a sleek maroon starfighter. Even if we fumbled through it, it’d be a fun way to spend the afternoon.</p>\n<p>Just a few hours later, I was lying beneath fluorescent lights in the Intensive Care Unit. My heart had been racing above 150 beats per minute for over an hour. It wasn’t slowing down.</p>\n<p>I didn’t know what was happening – if this seemingly ordinary day would become my last. It wasn’t dying that scared me. It was the possibility that I might never see our children grow up.</p>\n<p>I texted my wife from the hospital bed: <em>I’ve always wanted to tell our children I’d love them, no matter what.</em> They were too young to understand it now. But if I couldn’t be there to say it myself, I hoped the message would find its way to them someday.</p>\n<p>As it turned out, the spike in my heart rhythm was treatable and not life-threatening. I was discharged a day later, fazed but grateful.</p>\n<p>A week passed.</p>\n<p>And then, on another ordinary Saturday, my son and I built the starfighter.</p>\n<p>I handled the instructions and nudged the bricks into place. He sat beside me, snapping on bits and pieces. He was restless, as any toddler would be, but every time I asked if he wanted to stop, he said no. He wanted to keep going. So did I.</p>\n<p>Now the finished starfighter sits on a shelf in the living room, pointed towards the window, catching sunlight on its wings. Outside, the birds are singing. Inside, I hear the two of you laughing.</p>\n",
				"content_text": "It was a bright, busy Saturday morning. We wandered through the mall, our son darting ahead, and our daughter nestled in our arms. As we walked into the LEGO store, their eyes lit up. They always loved playing with the loose bricks near the front.\n\nI’d held off on buying a set since our son was born. He’d been too small for the tiny bricks. But now he was nearing three, and I thought maybe – just maybe – we could build something together. I chose a sleek maroon starfighter. Even if we fumbled through it, it’d be a fun way to spend the afternoon.\n\nJust a few hours later, I was lying beneath fluorescent lights in the Intensive Care Unit. My heart had been racing above 150 beats per minute for over an hour. It wasn’t slowing down. \n\nI didn’t know what was happening – if this seemingly ordinary day would become my last. It wasn’t dying that scared me. It was the possibility that I might never see our children grow up.\n\nI texted my wife from the hospital bed: *I’ve always wanted to tell our children I’d love them, no matter what.* They were too young to understand it now. But if I couldn’t be there to say it myself, I hoped the message would find its way to them someday.\n\nAs it turned out, the spike in my heart rhythm was treatable and not life-threatening. I was discharged a day later, fazed but grateful.\n\nA week passed.\n\nAnd then, on another ordinary Saturday, my son and I built the starfighter.\n\nI handled the instructions and nudged the bricks into place. He sat beside me, snapping on bits and pieces. He was restless, as any toddler would be, but every time I asked if he wanted to stop, he said no. He wanted to keep going. So did I.\n\nNow the finished starfighter sits on a shelf in the living room, pointed towards the window, catching sunlight on its wings. Outside, the birds are singing. Inside, I hear the two of you laughing.\n",
				"date_published": "2025-04-11T08:10:16+08:00",
				"url": "https://alvinsoon.com/2025/04/11/the-starfighter.html"
			}
	]
}
